{
    "contact": {
        "name": "Quinten Marsala",
        "phone": "18015587459",
        "title": "Sr. Softwae Engineer",
        "email": "quinten.marsala@gmail.com",
        "city": "Spokane",
        "state": "WA",
        "links": [
            {
                "name": "linkedin",
                "url": "https://www.linkedin.com/in/qmarsala"
            },
            {
                "name": "github",
                "url": "https://github.com/qmarsala"
            }
        ]
    },
    "aboutme": [
        "I enjoy helping people by solving problems with technology and creating something new.",
        "In my free time, I enjoy golfing, video games, and even more programming."
    ],
    "education": [
        {
            "educationAuthority": "Utah Valley University",
            "degreeOrCertificate": "Computer Science",
            "date": "August 2019"
        }
    ],
    "experience": [
        {
            "company": "Cricut, Inc",
            "position": "Sr. Software Engineer, Enablement",
            "date": "June 2020 - Present",
            "projects": [
                {
                    "title": "Enablement",
                    "description": [
                        "Researched and designed POC's using new technologies and patterns, such as: Kafka, and graph databases",
                        "Developed shared libraries to improve the productivity of the developers on various teams",
                        "Developed dotnet templates to improve the speed and consistency of beginning a new project",
                        "Assisted in the development of a ci/cd pipeline built on GitHub Actions"
                    ]
                },
                {
                    "title": "Subscriptions & E-commerce",
                    "description": [
                        "Assisted with the design and implementation of the subscriptions platform utilizing Kafka",
                        "Assisted with the design and implementation of the digital entitlements platform utilizing Neo4j"
                    ]
                }
            ]
        },
        {
            "company": "Cricut, Inc",
            "position": "Sr. Software Engineer",
            "date": "October 2019 - June 2020",
            "projects": [
                {
                    "title": "Community",
                    "description": [
                        "Implemented custom cdn for cricut images using AWS Lambda@Edge and S3",
                        "Helped make improvements to the taxonomy system that categorizes the content within Design Space"
                    ]
                }
            ]
        },
        {
            "company": "Progressive Leasing",
            "position": "Tech Lead - Sr. Software Engineer",
            "date": "February 2019 - October 2019",
            "projects": [
                {
                    "title": "Checkout Platform",
                    "description": [
                        "Designed, implemented, and maintained a platform for customers to sign their lease agreement, and collect their initial lease payment.",
                        "Improved performance of the document creation process by reducing the memory footprint by 50%.",
                        "Reduced time to create the lease agreement document from 10+ seconds to an average of 3.",
                        "Improved insight into our production application by implementing Google Analytics."
                    ]
                }
            ]
        },
        {
            "company": "Progressive Leasing",
            "position": "Software Engineer",
            "date": "November 2017 - February 2019",
            "projects": [
                {
                    "title": "Electronic Store Payment Platform",
                    "description": [
                        "Designed and implemented a system to pay integrated stores for leased merchandise.",
                        "Reduced hours of work for accounting by allowing them to set up automatic payments to merchants.",
                        "Improved accounting's insight into merchant payments by providing searchable dashboards to quickly review payments being made to our merchants."
                    ]
                },
                {
                    "title": "Virtual Payment Platform",
                    "description": [
                        "Designed and implemented a system to pay stores in real time for leased merchandise allowing Progressive to do business with more big box retailers.",
                        "Provided a scalable way to set up pilots with new merchants by generating virtual credit cards to be used for purchasing the merchandise for the customer.",
                        "Coordinated integration efforts with third party provider."
                    ]
                },
                {
                    "title": "Automatic Lease Funding",
                    "description": [
                        "Maintained and implemented new features in a system that funded new leases.",
                        "Reduced ~100 hours of work per day for accounting and increased the scalability of the product by automatically reviewing the signed lease agreement and initiating store payment procedures."
                    ]
                }
            ]
        },
        {
            "company": "Progressive Leasing",
            "position": "Junior Software Engineer",
            "date": "February 2014 - November 2017",
            "projects": [
                {
                    "title": "Centralized Logging",
                    "description": [
                        "Built a syslog infrastructure using syslog-ng that would collect all of our systems logs and store them in a centralized and searchable location.",
                        "Greatly improved the ability to debug our production applications by providing a one stop shop for all of our applications logs."
                    ]
                }
            ]
        }
    ],
    "skills": [
        "C#",
        "AutoHotKey",
        "TypeScript",
        "JavaScript",
        "HTML",
        "CSS",
        "SQL",
        "Bash",
        "PowerShell",
        ".NET",
        "Angular",
        "React",
        "Vue",
        "Restful API’s",
        "Visual Studio",
        "VS Code",
        "MSSQL",
        "PostgreSQL",
        "Kafka",
        "Neo4j",
        "Redis",
        ".git",
        "GitHub Actions",
        "Object Oriented Programming",
        "Design Patterns",
        "Functional Programming"
    ]
}